ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_canfd.c
/*******************************************************************************
* \file cy_canfd.c
* \version 1.0
*
* \brief
*  Provides an API implementation of the CAN FD driver.
*
********************************************************************************
* \copyright
* Copyright 2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/
#include "cy_canfd.h"

#ifdef CY_IP_MXTTCANFD

#if defined(__cplusplus)
extern "C" {
#endif

/* Define for size of extended filter in word */
#define CY_CANFD_SIZE_OF_EXTID_FILTER_IN_WORD   (2U)

/* Define for size of transmit event FIFO in word */
#define CY_CANFD_SIZE_OF_TXEVENT_FIFO_IN_WORD   (2U)

/* Define for half maximum Rx buffers */
#define CY_CANFD_MESSAGE_HALF_OF_RX_BUFFERS     (32UL)

#define CY_CANFD_INTERRUPT_ENABLE_DEFAULT       (CANFD_CH_M_TTCAN_IE_DRXE_Msk |  /* Message stored to Rx Buffer */\
                                                 CANFD_CH_M_TTCAN_IE_RF1NE_Msk | /* Rx FIFO 1 New Message */\
                                                 CANFD_CH_M_TTCAN_IE_RF0NE_Msk)  /* Rx FIFO 0 New Message */ 
#define CY_CANFD_EXT_IDENTIFIER_LENGTH          (18U)

/* The configurable start addresses are 32-bit word addresses i.e. only bits 15 
* to 2 are evaluated, the two least significant bits are ignored */
#define CY_CANFD_MRAM_SIGNIFICANT_BYTES_SHIFT   (2U)

/* Size of R0 and R1 fields of Rx Buffer or FIFO Element in 32-bit words */
#define CY_CANFD_R0_R1_SIZE                     (2UL)

/* Size of T0 and T1 fields of Tx Buffer in 32-bit words */
#define CY_CANFD_T0_T1_SIZE                     (2UL) 
#define CY_CANFD_TX_EVENT_FIFO_ELEMENTS_NUM     (10UL)
#define CY_CANFD_CHANNEL_ADDR_MASK              (0xFFFF0000UL)

/* Standard Filter ID 2 */
#define CY_CANFD_SID_FILTER_S0_SFID2_Pos        (0UL)
#define CY_CANFD_SID_FILTER_S0_SFID2_Msk        (0x000007FFUL)

/* Standard Filter ID 1 */ 
#define CY_CANFD_SID_FILTER_S0_SFID1_Pos        (16UL)
#define CY_CANFD_SID_FILTER_S0_SFID1_Msk        (0x07FF0000UL)

/* Standard Filter Element Configuration */
#define CY_CANFD_SID_FILTER_S0_SFEC_Pos         (27UL)
#define CY_CANFD_SID_FILTER_S0_SFEC_Msk         (0x38000000UL)

/* Standard Filter Type */
#define CY_CANFD_SID_FILTER_S0_SFT_Pos          (30UL)
#define CY_CANFD_SID_FILTER_S0_SFT_Msk          (0xC0000000UL)

/* Extended Filter ID 2 */
#define CY_CANFD_XID_FILTER_F1_EFID2_Pos        (0UL)
#define CY_CANFD_XID_FILTER_F1_EFID2_Msk        (0x1FFFFFFFUL)

/* Extended Filter ID 1 */
#define CY_CANFD_XID_FILTER_F0_EFID1_Pos        (0UL)
#define CY_CANFD_XID_FILTER_F0_EFID1_Msk        (0x1FFFFFFFUL)

/* Extended Filter Element Configuration */
#define CY_CANFD_XID_FILTER_F0_EFEC_Pos         (29UL)
#define CY_CANFD_XID_FILTER_F0_EFEC_Msk         (0xE0000000UL)

/* Extended Filter Type */
#define CY_CANFD_XID_FILTER_F1_ETF_Pos          (30UL)
#define CY_CANFD_XID_FILTER_F1_ETF_Msk          (0xC0000000UL)

/* Tx Buffer Element Error State Indicator (ESI) */
#define CY_CANFD_TX_BUFFER_T0_ESI_Pos           (31UL)
#define CY_CANFD_TX_BUFFER_T0_ESI_Msk           (0x80000000UL)

/* Tx Buffer Element Extended Identifier (XTD) */
#define CY_CANFD_TX_BUFFER_T0_XTD_Pos           (30UL)
#define CY_CANFD_TX_BUFFER_T0_XTD_Msk           (0x40000000UL)

/* Tx Buffer Element Remote Transmission Request (RTR) */
#define CY_CANFD_TX_BUFFER_T0_RTR_Pos           (29UL)
#define CY_CANFD_TX_BUFFER_T0_RTR_Msk           (0x20000000UL)

/* Tx Buffer Element Identifier (ID) */
#define CY_CANFD_TX_BUFFER_T0_ID_Pos            (0UL)
#define CY_CANFD_TX_BUFFER_T0_ID_Msk            (0x1FFFFFFFUL)

/* Tx Buffer Element Message Marker (MM) */
#define CY_CANFD_TX_BUFFER_T1_MM_Pos            (24UL)
#define CY_CANFD_TX_BUFFER_T1_MM_Msk            (0xFF000000UL)

/* Tx Buffer Element Event FIFO Control (EFC) */
#define CY_CANFD_TX_BUFFER_T1_EFC_Pos           (23UL)
#define CY_CANFD_TX_BUFFER_T1_EFC_Msk           (0x00800000UL)

/* Tx Buffer Element FD Format (FDF) */
#define CY_CANFD_TX_BUFFER_T1_FDF_Pos           (21UL)
#define CY_CANFD_TX_BUFFER_T1_FDF_Msk           (0x00200000UL)

/* Tx Buffer Element Bit Rate Switching (BRS) */
#define CY_CANFD_TX_BUFFER_T1_BRS_Pos           (20UL)
#define CY_CANFD_TX_BUFFER_T1_BRS_Msk           (0x00100000UL)

/* Tx Buffer Element Data Length Code (DLC) */
#define CY_CANFD_TX_BUFFER_T1_DLC_Pos           (16UL)
#define CY_CANFD_TX_BUFFER_T1_DLC_Msk           (0x000F0000UL)

/* Rx Buffer and FIFO Element Identifier (ID) */
#define CY_CANFD_RX_BUFFER_R0_ID_Pos            (0UL)
#define CY_CANFD_RX_BUFFER_R0_ID_Msk            (0x1FFFFFFFUL)

/* Rx Buffer and FIFO Element Remote Transmission Request (RTR) */
#define CY_CANFD_RX_BUFFER_R0_RTR_Pos           (29UL)
#define CY_CANFD_RX_BUFFER_R0_RTR_Msk           (0x20000000UL)

/* Rx Buffer and FIFO Element Extended Identifier (XTD) */
#define CY_CANFD_RX_BUFFER_R0_XTD_Pos           (30UL)
#define CY_CANFD_RX_BUFFER_R0_XTD_Msk           (0x40000000UL)

/* Rx Buffer and FIFO Element Error State Indicator (ESI) */
#define CY_CANFD_RX_BUFFER_R0_ESI_Pos           (31UL)
#define CY_CANFD_RX_BUFFER_R0_ESI_Msk           (0x80000000UL)

/* Rx Buffer and FIFO Element Rx Timestamp (RXTS) */
#define CY_CANFD_RX_BUFFER_R1_RXTS_Pos          (0UL)
#define CY_CANFD_RX_BUFFER_R1_RXTS_Msk          (0x0000FFFFUL)

/* Rx Buffer and FIFO Element Data Length Code (DLC) */
#define CY_CANFD_RX_BUFFER_R1_DLC_Pos           (16UL)
#define CY_CANFD_RX_BUFFER_R1_DLC_Msk           (0x000F0000UL)

/* Rx Buffer and FIFO Element Bit Rate Switch (BRS) */
#define CY_CANFD_RX_BUFFER_R1_BRS_Pos           (20UL)
#define CY_CANFD_RX_BUFFER_R1_BRS_Msk           (0x00100000UL)

/* Rx Buffer and FIFO Element FD Format (FDF) */
#define CY_CANFD_RX_BUFFER_R1_FDF_Pos           (21UL)
#define CY_CANFD_RX_BUFFER_R1_FDF_Msk           (0x00200000UL)

/* Rx Buffer and FIFO Element Filter Index (FIDX) */
#define CY_CANFD_RX_BUFFER_R1_FIDX_Pos          (24UL)
#define CY_CANFD_RX_BUFFER_R1_FIDX_Msk          (0x7F000000UL)

/* Rx Buffer and FIFO Element Accepted Non-matching Frame (ANMF) */
#define CY_CANFD_RX_BUFFER_R1_ANMF_Pos          (31UL)
#define CY_CANFD_RX_BUFFER_R1_ANMF_Msk          (0x80000000UL)

#define CY_CANFD_ERRORS_MASK     (CANFD_CH_M_TTCAN_IR_RF0W_Msk  | /* Rx FIFO 0 Watermark Reached */\
                                  CANFD_CH_M_TTCAN_IR_RF0F_Msk  | /* Rx FIFO 0 Full */\
                                  CANFD_CH_M_TTCAN_IR_RF0L__Msk | /* Rx FIFO 0 Message Lost */\
                                  CANFD_CH_M_TTCAN_IR_RF1W_Msk  | /* Rx FIFO 1 Watermark Reached */\
                                  CANFD_CH_M_TTCAN_IR_RF1F_Msk  | /* Rx FIFO 1 Full */\
                                  CANFD_CH_M_TTCAN_IR_RF1L__Msk | /* Rx FIFO 1 Message Lost */\
                                  CANFD_CH_M_TTCAN_IR_TEFW_Msk  | /* Tx Event FIFO Watermark Reached */\
                                  CANFD_CH_M_TTCAN_IR_TEFF_Msk  | /* Tx Event FIFO Full */\
                                  CANFD_CH_M_TTCAN_IR_TEFL__Msk | /* Tx Event FIFO Element Lost */\
                                  CANFD_CH_M_TTCAN_IR_TSW_Msk  | /* Timestamp Wraparound */\
                                  CANFD_CH_M_TTCAN_IR_MRAF_Msk | /* Message RAM Access Failure */\
                                  CANFD_CH_M_TTCAN_IR_TOO_Msk  | /* Timeout Occurred */\
                                  CANFD_CH_M_TTCAN_IR_BEC_Msk  | /* Bit Error Corrected */\
                                  CANFD_CH_M_TTCAN_IR_BEU_Msk  | /* Bit Error Uncorrected */\
                                  CANFD_CH_M_TTCAN_IR_ELO_Msk  | /* Error Logging Overflow */\
                                  CANFD_CH_M_TTCAN_IR_EP__Msk  | /* Error Passive */\
                                  CANFD_CH_M_TTCAN_IR_EW__Msk  | /* Warning Status */\
                                  CANFD_CH_M_TTCAN_IR_BO__Msk  | /* Bus_Off Status */\
                                  CANFD_CH_M_TTCAN_IR_WDI_Msk  | /* Watchdog Interrupt */\
                                  CANFD_CH_M_TTCAN_IR_PEA_Msk  | /* Protocol Error in Arb. Phase */\
                                  CANFD_CH_M_TTCAN_IR_PED_Msk  | /* Protocol Error in Data Phase */\
                                  CANFD_CH_M_TTCAN_IR_ARA_Msk)   /* Access to Reserved Address */

