ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_canfd.c
            /* Standard Message ID filters */
            Cy_CANFD_SidFiltersSetup(base, chan, config->sidFilterConfig, context);

            /* Extended Message ID filters */
            Cy_CANFD_XidFiltersSetup(base, chan,  config->extidFilterConfig, context);

            /* Configure the interrupt */
            Cy_CANFD_SetInterruptMask(base, chan, CY_CANFD_INTERRUPT_ENABLE_DEFAULT);
            
            /* Enable TX complete interrupts for used TX buffers */
            CANFD_TXBTIE(base, chan) = (uint32_t)(~(0xFFFFFFFFUL << config->noOfTxBuffers));

            /* Set interrupt line 0 */
            Cy_CANFD_SetInterruptLine(base, chan, 0UL);

            /* Enable interrupt line 0 */
            Cy_CANFD_EnableInterruptLine(base, chan, CANFD_CH_M_TTCAN_ILE_EINT0_Msk);
            
            /* Clear CCCR_INIT bit and wait until it is updated to finalize CAN FD initialization */
            ret = Cy_CANFD_ConfigChangesDisable(base, chan);
        }
        else
        {
           ret = CY_CANFD_ERROR_TIMEOUT; 
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_CANFD_DeInit
****************************************************************************//**
*
*  De-initializes the CAN FD block, returns registers values to default.
*
* \note
* Do not call Cy_CANFD_Disable before Cy_CANFD_DeInit.
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*  The CAN FD channel number.
*
* \param *context
* The pointer to the context structure \ref cy_stc_canfd_context_t allocated
* by the user. The structure is used during the CAN FD operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return 
* \ref cy_en_canfd_status_t
*
* \funcusage 
* \snippet canfd/snippet/main.c snippet_Cy_CANFD_DeInit
*
*******************************************************************************/
cy_en_canfd_status_t Cy_CANFD_DeInit(CANFD_Type *base, uint32_t chan, cy_stc_canfd_context_t *context)
{
    uint32_t* address;
    uint32_t  retry = CY_CANFD_RETRY_COUNT;
    uint32_t  count;
    uint32_t  sizeInWord;
    cy_en_canfd_status_t ret = CY_CANFD_ERROR_TIMEOUT;

    /* Reset the notification callback functions */
    context->canFDInterruptHandling.canFDTxInterruptFunction = NULL;
    context->canFDInterruptHandling.canFDRxInterruptFunction = NULL;
    context->canFDInterruptHandling.canFDErrorInterruptFunction = NULL;

    /* Set the CCCR_INIT bit and wait until it is updated */
    CANFD_CCCR(base, chan) = CANFD_CH_M_TTCAN_CCCR_INIT_Msk;

    while ((retry > 0UL) && !_FLD2BOOL(CANFD_CH_M_TTCAN_CCCR_INIT, CANFD_CCCR(base, chan)))
    {
        Cy_SysLib_DelayUs(CY_CANFD_INIT_TIMEOUT_MS);
        retry--;
    }

    if (retry > 0UL)
    { 
        /* Enable configuration changes */
        CANFD_CCCR(base, chan) |= CANFD_CH_M_TTCAN_CCCR_CCE_Msk;

        /* Standard ID filter */
        CANFD_SIDFC(base, chan) = 0UL; 

        /* Extended ID filter */
        CANFD_XIDFC(base, chan) = 0UL;

        /* Extended ID AND Mask */
        CANFD_XIDAM(base, chan) = CANFD_CH_M_TTCAN_XIDAM_EIDM_Msk;

        /* Configuration of Rx Buffer and Rx FIFO */
        CANFD_RXESC(base, chan) = 0UL;

        /* Rx FIFO 0 */
        CANFD_RXF0C(base, chan) = 0UL;

        /* Rx FIFO 1 */
        CANFD_RXF1C(base, chan) = 0UL;

        /* Rx FIFO Top pointer logic*/
        CANFD_RXFTOP_CTL(base, chan) = 0UL;

        /* Rx buffer */
        CANFD_RXBC(base, chan) = 0UL;

        /* Configuration of Tx Buffer and Tx FIFO/Queue */
        CANFD_TXESC(base, chan) = 0UL;

        /* Tx FIFO/QUEUE (not used) */
        CANFD_TXEFC(base, chan) = 0UL;

        /* Tx buffer */
        CANFD_TXBC(base, chan) = 0UL;

        /* Initialize the Message RAM area (Entire region zeroing) for the channel */
        address = (uint32_t *)(context->messageRAMaddress);
        sizeInWord = context->messageRAMsize >> CY_CANFD_MRAM_SIGNIFICANT_BYTES_SHIFT;
        for(count = 0UL; count < sizeInWord; count++)
        {
            *address++ = 0UL;
        }

        /* The configuration of the CAN bus */
        
        /* Keep the initialization and configuration change enabled */
        CANFD_CCCR(base, chan) = CANFD_CH_M_TTCAN_CCCR_INIT_Msk | CANFD_CH_M_TTCAN_CCCR_CCE_Msk;

        /* Set the nominal bit timing & prescaler register to the default value */
        CANFD_NBTP(base, chan) = CANFD_NBTP_DEF_VAL; 

        /* Set the data bit timing & prescaler register to the default value */
        CANFD_DBTP(base, chan) = CANFD_DBTP_DEF_VAL; 

        /* Transmitter delay compensation */
        CANFD_TDCR(base, chan) = 0UL;

        /* The configuration of a global filter */
        CANFD_GFC(base, chan) = 0UL;

        /* Enable interrupt configuration */
        CANFD_IE(base, chan) = 0UL;

        /* Select interrupt line configuration */
        CANFD_ILS(base, chan) = 0UL;

        /* Enable the interrupt line configuration */
        CANFD_ILE(base, chan) = 0UL;

        ret = CY_CANFD_SUCCESS;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_CANFD_GetLastError
****************************************************************************//**
*
*  Returns the value of Protocol Status Register (PSR). \n
*  Use the \ref group_canfd_last_state_masks to extract necessary fields from 
*  the register. \n
*  Use the \ref cy_en_canfd_LEC_t enumeration to interpret LEC and DLEC fields. \n
*  Use the \ref cy_en_canfd_PSR_ACT_t enumeration to interpret the  ACT field.
*
* \note Protocol Status Register has reset on read fields. Reading the register
*  will clear the bits PXE, RFDF, RBRS and RESI, and set DLEC[2:0] and LEC[2:0].
*  
*
* \param *base
* The pointer to a CAN FD instance.
*
* \param chan
*  The CAN FD channel number.
*
* \return 
*  Content of the Protocol Status Register (PSR).
*
*******************************************************************************/
uint32_t Cy_CANFD_GetLastError(CANFD_Type *base, uint32_t chan)
{
    return CANFD_PSR(base, chan);
}


